In [2]:
from datasets import load_dataset
import pandas as pd
from huggingface_hub import HfApi, list_models

In [3]:
# Use root method
models = list_models()

# Or configure a HfApi client
hf_api = HfApi(
    endpoint="https://huggingface.co", # Can be a Private Hub endpoint.
    token="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", # Token is not persisted on the machine.
)
models = hf_api.list_models()

In [4]:
trex = load_dataset("lama", 'trex', trust_remote_code=True)
# Convert the trex to a pandas DataFrame
trex = pd.DataFrame(trex['train'])

# Display the DataFrame
display(trex.head())

,uuid,obj_uri,obj_label,sub_uri,sub_label,predicate_id,sub_surface,obj_surface,masked_sentence,template,template_negated,label,description,type
0,685a27c6-c910-4c9f-bc30-b115c662bbee,Q23115,Northamptonshire,Q4649521,A605 road,P131,A605 road,Northamptonshire,The A605 road is a main road in the English co...,[X] is located in [Y] .,[X] is not located in [Y] .,located in the administrative territorial entity,the item is located on the territory of the fo...,N-1
1,685a27c6-c910-4c9f-bc30-b115c662bbee,Q23115,Northamptonshire,Q4649521,A605 road,P131,A605 road,Northamptonshire,The A605 road is a main road in the English co...,[X] is located in [Y] .,[X] is not located in [Y] .,located in the administrative territorial entity,the item is located on the territory of the fo...,N-1
2,685a27c6-c910-4c9f-bc30-b115c662bbee,Q23115,Northamptonshire,Q4649521,A605 road,P131,A605,Northamptonshire,It connects the Leicestershire town of Market ...,[X] is located in [Y] .,[X] is not located in [Y] .,located in the administrative territorial entity,the item is located on the territory of the fo...,N-1
3,685a27c6-c910-4c9f-bc30-b115c662bbee,Q23115,Northamptonshire,Q4649521,A605 road,P131,A605,Northamptonshire,It connects the Leicestershire town of Market ...,[X] is located in [Y] .,[X] is not located in [Y] .,located in the administrative territorial entity,the item is located on the territory of the fo...,N-1
4,685a27c6-c910-4c9f-bc30-b115c662bbee,Q23115,Northamptonshire,Q4649521,A605 road,P131,A605,Northamptonshire,It connects the Leicestershire town of Market ...,[X] is located in [Y] .,[X] is not located in [Y] .,located in the administrative territorial entity,the item is located on the territory of the fo...,N-1

In [5]:
trex['template'].value_counts()

template
[X] shares border with [Y] .                     317841
[X] maintains diplomatic relations with [Y] .    285494
The official language of [X] is [Y] .            176651
The capital of [X] is [Y] .                      115182
[X] is the capital of [Y] .                      101259
[X] is located in [Y] .                           88686
[X] is part of [Y] .                              26049
[X] is a legal term in [Y] .                      23877
[X] is a subclass of [Y] .                        16238
[X] and [Y] are twin cities .                     14436
[X] consists of [Y] .                             12964
[X] is named after [Y] .                          11443
[X] is developed by [Y] .                          8114
[X] is owned by [Y] .                              7729
The headquarter of [X] is in [Y] .                 7277
[X] is produced by [Y] .                           7196
[X] was originally aired on [Y] .                  7026
[X] was created in [Y] .                           5736
[X] plays [Y] music .                              5702
The native language of [X] is [Y] .                5355
[X] is a [Y] .                                     4962
[X] is [Y] citizen .                               4386
[X] was written in [Y] .                           4301
[X] used to communicate in [Y] .                   4160
[X] plays [Y] .                                    3767
[X] has the position of [Y] .                      3711
[X] is affiliated with the [Y] religion .          3618
[X] works in the field of [Y] .                    3504
[X] is represented by music label [Y] .            3479
[X] was founded in [Y] .                           3352
[X] used to work in [Y] .                          3275
The original language of [X] is [Y] .              3010
[X] is a member of [Y] .                           2916
[X] died in [Y] .                                  2891
[X] is a [Y] by profession .                       2574
[X] plays in [Y] position .                        2462
[X] was born in [Y] .                              2361
[X] works for [Y] .                                1407
Name: count, dtype: int64

In [6]:

filter = trex['template'] == '[X] and [Y] are twin cities .'
language = trex[filter]
language = language[['sub_label', 'template', 'obj_label', 'masked_sentence']]
language.reset_index(drop=True, inplace=True)
display(language)

,sub_label,template,obj_label,masked_sentence
0,Valencia,[X] and [Y] are twin cities .,Mainz,He promoted the twinning of the cities of Vale...
1,Istanbul,[X] and [Y] are twin cities .,Athens,"It is available in: Abu Dhabi, Aix En Provence..."
2,Istanbul,[X] and [Y] are twin cities .,Athens,He was sent on missions to Moscow (1909) and I...
3,Istanbul,[X] and [Y] are twin cities .,Athens,Grigoris Asikis (Greek: Γρηγόρης Ασίκης) (1890...
4,Istanbul,[X] and [Y] are twin cities .,Athens,The following year consulates-general were (re...
...,...,...,...,...
14431,Istanbul,[X] and [Y] are twin cities .,Casablanca,"It is available in: Abu Dhabi, Aix En Provence..."
14432,Istanbul,[X] and [Y] are twin cities .,Casablanca,He won the Biennale de Turquie (International ...
14433,Istanbul,[X] and [Y] are twin cities .,Casablanca,More than 1140 Citadis trams are in use in ove...
14434,Istanbul,[X] and [Y] are twin cities .,Casablanca,"[citation needed] At March 2000, Moscow Sherem..."
14435,Istanbul,[X] and [Y] are twin cities .,Casablanca,He was noted in particularly for his work in M...

In [8]:
filter = trex['template'] == '[X] works for [Y] .'
worksfor = trex[filter]
worksfor = worksfor[['sub_label', 'template', 'obj_label', 'masked_sentence']]
worksfor.reset_index(drop=True, inplace=True)
display(worksfor)

,sub_label,template,obj_label,masked_sentence
0,John Cage,[X] plays [Y] music .,opera,Her performance of John Cage's Six Melodies pl...
1,Herbie Mann,[X] plays [Y] music .,jazz,"Herbert Jay Solomon (April 16, 1930 – July 1, ..."
2,Herbie Mann,[X] plays [Y] music .,jazz,"Herbert Jay Solomon (April 16, 1930 – July 1, ..."
3,Herbie Mann,[X] plays [Y] music .,jazz,"After Eric Dolphy and alongside Herbie Mann, L..."
4,Herbie Mann,[X] plays [Y] music .,jazz,Memphis Underground is a 1969 album by [MASK] ...
...,...,...,...,...
5697,Gilad Atzmon,[X] plays [Y] music .,jazz,Gilad Atzmon (Hebrew: גלעד עצמון; born 9 June ...
5698,Yellow Dog Records,[X] plays [Y] music .,jazz,Yellow Dog Records is an American independent ...
5699,Yellow Dog Records,[X] plays [Y] music .,jazz,Yellow Dog Records is an American independent ...
5700,Frank Mantooth,[X] plays [Y] music .,jazz,"Frank Mantooth (April 11, 1947, Tulsa, Oklahom..."
5701,Frank Mantooth,[X] plays [Y] music .,jazz,"Frank Mantooth (April 11, 1947, Tulsa, Oklahom..."

In [22]:
theCapital_is = trex[trex['template'] == 'The capital of [X] is [Y] .']
theCapital_is = theCapital_is[['sub_label', 'template', 'obj_label', 'masked_sentence']]
theCapital_is.reset_index(drop=True, inplace=True)
display(theCapital_is)

,sub_label,template,obj_label,masked_sentence
0,Azerbaijan,The capital of [X] is [Y] .,Baku,The capital of Azerbaijan is the ancient city ...
1,Azerbaijan,The capital of [X] is [Y] .,Baku,The capital of Azerbaijan is the ancient city ...
2,Azerbaijan,The capital of [X] is [Y] .,Baku,"[MASK] (Azerbaijani: Bakı, [bɑˈcɯ]) is the cap..."
3,Azerbaijan,The capital of [X] is [Y] .,Baku,"[MASK] (Azerbaijani: Bakı, [bɑˈcɯ]) is the cap..."
4,Azerbaijan,The capital of [X] is [Y] .,Baku,As of early 2014 company has a total of 15 loc...
...,...,...,...,...
115177,Flanders,The capital of [X] is [Y] .,Brussels,"The tram route 19 in [MASK], Belgium is a tram..."
115178,Flanders,The capital of [X] is [Y] .,Brussels,"The tram route 19 in Brussels, Belgium is a tr..."
115179,Flanders,The capital of [X] is [Y] .,Brussels,"The tram route 39 in [MASK], Belgium is a tram..."
115180,Flanders,The capital of [X] is [Y] .,Brussels,"The tram route 44 in [MASK], Belgium is a tram..."
115181,Flanders,The capital of [X] is [Y] .,Brussels,"The tram route 82 in [MASK], Belgium is a tram..."

In [23]:
capital_repeat = theCapital_is[['obj_label', 'sub_label']].value_counts().reset_index(name='count')
capital_repeat['count'].value_counts()
display(capital_repeat)

      obj_label                                        sub_label  count
0    Copenhagen                                          Denmark   3020
1     Stockholm                                           Sweden   2835
2         Tokyo                                            Japan   2809
3         Seoul                                      South Korea   2624
4          Oslo                                           Norway   2551
..          ...                                              ...    ...
697    Florence                             Province of Florence      1
698       Seoul  United States Army Military Government in Korea      1
699       Bryan                                    Brazos County      1
700      Mobile                                    Mobile County      1
701   Jerusalem                             Kingdom of Jerusalem      1

[702 rows x 3 columns]

In [28]:
citizen = trex[trex['template'] == '[X] is [Y] citizen .']
citizen = citizen[['sub_label', 'template', 'obj_label', 'masked_sentence']]
citizen.reset_index(drop=True, inplace=True)
display(citizen)

,sub_label,template,obj_label,masked_sentence
0,Rubens Barrichello,[X] is [Y] citizen .,Brazil,"It was the final race of the 2004 season, and ..."
1,Yves Mirande,[X] is [Y] citizen .,France,"Yves Mirande (Bagneux (Maine-et-Loire), Mai 8,..."
2,Yves Mirande,[X] is [Y] citizen .,France,"Yves Mirande (Bagneux (Maine-et-Loire), Mai 8,..."
3,August Gailit,[X] is [Y] citizen .,Estonia,Sangaste is also the birthplace of the [MASK] ...
4,August Gailit,[X] is [Y] citizen .,Estonia,Sangaste is also the birthplace of the Estonia...
...,...,...,...,...
4381,Vesa Vierikko,[X] is [Y] citizen .,Finland,"In addition to these, many well-known [MASK] a..."
4382,Gianni Ferrio,[X] is [Y] citizen .,Italy,"Consequently, the host conductor, [MASK]'s Gia..."
4383,Sun Beibei,[X] is [Y] citizen .,Singapore,He was on [MASK] A team at the 2006 Australian...
4384,Edward Wollstonecraft,[X] is [Y] citizen .,Australia,Edward Wollstonecraft (1783-1832) was a succes...
4385,Edward Wollstonecraft,[X] is [Y] citizen .,Australia,Edward Wollstonecraft (1783-1832) was a succes...

In [35]:
citizen_repeat = citizen[['obj_label', 'sub_label']].value_counts().reset_index(name='count')
citizen_repeat['count'].value_counts()
display(citizen_repeat)

    obj_label                     sub_label  count
0     England        Elizabeth I of England    546
1     England              James VII and II    269
2     England            Henry V of England    128
3     Vietnam                   Ho Chi Minh     68
4       Qatar    Hamad bin Khalifa Al Thani     65
..        ...                           ...    ...
961      Oman  Yusuf bin Alawi bin Abdullah      1
962  Pakistan            Ahmad Nadeem Qasmi      1
963  Pakistan                  Bapsi Sidhwa      1
964    Canada               John Sellekaers      1
965   Nigeria                  Oladipo Diya      1

[966 rows x 3 columns]

In [31]:
born_in = trex[trex['template'] == '[X] was born in [Y] .']
born_in = born_in[['sub_label', 'template', 'obj_label', 'masked_sentence']]
born_in.reset_index(drop=True, inplace=True)
display(born_in)

,sub_label,template,obj_label,masked_sentence
0,Allan Peiper,[X] was born in [Y] .,Alexandra,"Allan Peiper (born 26 April 1960 in [MASK], Au..."
1,Allan Peiper,[X] was born in [Y] .,Alexandra,"Allan Peiper (born 26 April 1960 in [MASK], Au..."
2,Anthony Barber,[X] was born in [Y] .,Doncaster,It was won by the Conservative candidate Antho...
3,Paul Mounsey,[X] was born in [Y] .,Scotland,NahooToo is the second album by [MASK] musicia...
4,Paul Mounsey,[X] was born in [Y] .,Scotland,City of Walls is the fourth album by [MASK] mu...
...,...,...,...,...
2356,Lorraine Pilkington,[X] was born in [Y] .,Dublin,Lorraine Pilkington (born 18 April 1974) is an...
2357,Lopo Soares de Albergaria,[X] was born in [Y] .,Lisbon,"Lopo Soares de Albergaria ([MASK], c."
2358,Lopo Soares de Albergaria,[X] was born in [Y] .,Lisbon,In March 1515 Lopo Soares de Albergaria was ch...
2359,Lopo Soares de Albergaria,[X] was born in [Y] .,Lisbon,"Lopo Soares de Albergaria ([MASK], c."
2360,Lopo Soares de Albergaria,[X] was born in [Y] .,Lisbon,In March 1515 Lopo Soares de Albergaria was ch...

In [32]:
born_in_repeat = born_in[['obj_label', 'sub_label']].value_counts().reset_index(name='count')
born_in_repeat['count'].value_counts()
display(born_in_repeat)

          obj_label                            sub_label  count
0            Moscow                     Leonid Sabaneyev     50
1           Bohemia             Vratislaus II of Bohemia     21
2            London                         Henry Mayhew     16
3            Lisbon                   John V of Portugal     15
4       Westminster                  Edward I of England     14
..              ...                                  ...    ...
939          Dallas                 Clint Murchison, Jr.      1
940          Prague                         Otto Jelinek      1
941      Queensland                      Fergus McMaster      1
942  Constantinople                   Thomas Palaiologos      1
943       Yorkshire  Thomas Robinson, 1st Baron Grantham      1

[944 rows x 3 columns]

In [33]:
died_in = trex[trex['template'] == '[X] died in [Y] .']
died_in = died_in[['sub_label', 'template', 'obj_label', 'masked_sentence']]
died_in.reset_index(drop=True, inplace=True)
display(died_in)

,sub_label,template,obj_label,masked_sentence
0,Akihiko Saito,[X] died in [Y] .,Iraq,"Akihiko Saito (斎藤昭彦 Saitō Akihiko, born Januar..."
1,Akihiko Saito,[X] died in [Y] .,Iraq,"Akihiko Saito (斎藤昭彦 Saitō Akihiko, born Januar..."
2,Akihiko Saito,[X] died in [Y] .,Iraq,"Akihiko Saito (斎藤昭彦 Saitō Akihiko, born Januar..."
3,Akihiko Saito,[X] died in [Y] .,Iraq,"Akihiko Saito (斎藤昭彦 Saitō Akihiko, born Januar..."
4,Charles Nodier,[X] died in [Y] .,Paris,It is usually said that he studied in [MASK] w...
...,...,...,...,...
2886,Giovanni Battista Sammartini,[X] died in [Y] .,Milan,He appears to have been a more prolific sympho...
2887,Joel Palmer,[X] died in [Y] .,Dayton,The Palmer House (also Joel Palmer House and K...
2888,Healey Willan,[X] died in [Y] .,Toronto,"Born in Saint John, New Brunswick, Wry studied..."
2889,Healey Willan,[X] died in [Y] .,Toronto,"Born in Toronto, Ontario, Bales studied at the..."
2890,"Margaret Cavendish, Duchess of Newcastle-upon-...",[X] died in [Y] .,England,"Henrietta Harley (née Holles), Countess of Oxf..."

In [34]:
died_in_repeat = died_in[['obj_label', 'sub_label']].value_counts().reset_index(name='count')
died_in_repeat['count'].value_counts()
display(died_in_repeat)

      obj_label                         sub_label  count
0        Madrid                  Francisco Franco     69
1      Montreal                      Jean Drapeau     51
2         Derby            Joseph Wright of Derby     45
3          Rome                      Michelangelo     42
4        London           Joseph Henry Blackburne     29
..          ...                               ...    ...
948      Dayton                       Joel Palmer      1
949       Paris            Jean-Yves Daniel-Lesur      1
950  Birmingham  Herbert Austin, 1st Baron Austin      1
951  Birmingham                      Joe Bradford      1
952    Hartford                      Horton Foote      1

[953 rows x 3 columns]

In [9]:
filter = trex['template'] == '[X] plays [Y] music .'
palys_music = trex[filter]
palys_music = palys_music[['sub_label', 'template', 'obj_label', 'masked_sentence']]
palys_music.reset_index(drop=True, inplace=True)
display(palys_music)

,sub_label,template,obj_label,masked_sentence
0,John Cage,[X] plays [Y] music .,opera,Her performance of John Cage's Six Melodies pl...
1,Herbie Mann,[X] plays [Y] music .,jazz,"Herbert Jay Solomon (April 16, 1930 – July 1, ..."
2,Herbie Mann,[X] plays [Y] music .,jazz,"Herbert Jay Solomon (April 16, 1930 – July 1, ..."
3,Herbie Mann,[X] plays [Y] music .,jazz,"After Eric Dolphy and alongside Herbie Mann, L..."
4,Herbie Mann,[X] plays [Y] music .,jazz,Memphis Underground is a 1969 album by [MASK] ...
...,...,...,...,...
5697,Gilad Atzmon,[X] plays [Y] music .,jazz,Gilad Atzmon (Hebrew: גלעד עצמון; born 9 June ...
5698,Yellow Dog Records,[X] plays [Y] music .,jazz,Yellow Dog Records is an American independent ...
5699,Yellow Dog Records,[X] plays [Y] music .,jazz,Yellow Dog Records is an American independent ...
5700,Frank Mantooth,[X] plays [Y] music .,jazz,"Frank Mantooth (April 11, 1947, Tulsa, Oklahom..."
5701,Frank Mantooth,[X] plays [Y] music .,jazz,"Frank Mantooth (April 11, 1947, Tulsa, Oklahom..."

In [8]:
def select_duplicate_examples(df, sub_label, obj_label):
    """
    Seleciona os dois primeiros exemplos de cada combinação duplicada de 'sub_label' e 'obj_label' em um DataFrame.

    Parâmetros:
    df (pandas.DataFrame): O DataFrame contendo as colunas 'sub_label', 'obj_label' e 'masked_sentence'.

    Retorna:
    pandas.DataFrame: Um DataFrame contendo apenas os dois primeiros exemplos de cada combinação duplicada.
    """
    # Contar o número de ocorrências de cada combinação de sub_label e obj_label
    counts = df.groupby([sub_label, obj_label]).size()

    # Selecionar apenas as combinações que possuem mais de 1 ocorrência
    duplicate_combinations = counts[counts > 1].index.tolist()

    # Criar um DataFrame contendo apenas essas combinações duplicadas
    duplicated_df = df[df.apply(lambda row: (row[sub_label], row[obj_label]) in duplicate_combinations, axis=1)]

    # Selecionar apenas os dois primeiros exemplos de cada combinação duplicada
    final_df = duplicated_df.groupby([sub_label, obj_label]).head(2).reset_index(drop=True)

    return final_df

In [109]:
filtrado_duo_died_in = select_duplicate_examples(died_in, "sub_label", 'obj_label')
filtrado_duo_died_in.to_csv('D:/tese/code/data/novos_data/filtrado_duo_died_in.csv')
filtrado_one_died_in = died_in.drop_duplicates(subset=["sub_label", 'obj_label'])
filtrado_one_died_in.to_csv('D:/tese/code/data/novos_data/filtrado_one_died_in.csv')

filtrado_duo_born_in = select_duplicate_examples(born_in, "sub_label", 'obj_label')
filtrado_duo_born_in.to_csv('D:/tese/code/data/novos_data/filtrado_duo_born_in.csv')
filtrado_one_born_in = born_in.drop_duplicates(subset=["sub_label", 'obj_label'])
filtrado_one_born_in.to_csv('D:/tese/code/data/novos_data/filtrado_one_born_in.csv')

filtrado_duo_citizen = select_duplicate_examples(citizen, "sub_label", 'obj_label')
filtrado_duo_citizen.to_csv('D:/tese/code/data/novos_data/filtrado_duo_citizen.csv')
filtrado_one_citizen = citizen.drop_duplicates(subset=["sub_label", 'obj_label'])
filtrado_one_citizen.to_csv('D:/tese/code/data/novos_data/filtrado_one_citizen.csv')

filtrado_duo_theCapital_is = select_duplicate_examples(theCapital_is, "sub_label", 'obj_label')
filtrado_duo_theCapital_is.to_csv('D:/tese/code/data/novos_data/filtrado_duo_theCapital_is.csv')
filtrado_one_theCapital_is = theCapital_is.drop_duplicates(subset=["sub_label", 'obj_label'])
filtrado_one_theCapital_is.to_csv('D:/tese/code/data/novos_data/filtrado_one_theCapital_is.csv')

filtrado_duo_worksfor = select_duplicate_examples(worksfor, "sub_label", 'obj_label')
filtrado_duo_worksfor.to_csv('D:/tese/code/data/novos_data/filtrado_duo_worksfor.csv')
filtrado_one_worksfor = worksfor.drop_duplicates(subset=["sub_label", 'obj_label'])
filtrado_one_worksfor.to_csv('D:/tese/code/data/novos_data/filtrado_one_worksfor.csv')

In [10]:
filtrado_duo_language = select_duplicate_examples(language, "sub_label", 'obj_label')
filtrado_duo_language.to_csv('/home/rafael/tese/code/data/novos_data/filtrado_duo_language.csv')
filtrado_one_language = language.drop_duplicates(subset=["sub_label", 'obj_label'])
filtrado_one_language.to_csv('/home/rafael/tese/code/data/novos_data/filtrado_one_language.csv')